# Pandas CheatSheet
> " 안 쓰면 잊어버리는, pandas에서의 주요 Dataframe 조작 방법들을 정리"

- badges: false
- comments: true
- author: limyj0708
- categories: [Pandas]
- sticky_rank: 1
- toc: true

In [67]:
import pandas as pd
import numpy as np

## 1. Dataframe 생성

### 1-1. Dictionary에서 Dataframe 생성

In [3]:
data = {'col_1': [3, 2, 1, 0], 'col_2': ['a', 'b', 'c', 'd']}
pd.DataFrame.from_dict(data)
# key가 컬럼, value로 들어간 리스트가 컬럼의 row 하나하나가 된다.

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [4]:
dict_list = [
    { "id" : 1001001, "address" : "AABCC"}
    ,{ "id" : 2101001, "address" : "BBBDD"}
    ,{ "id" : 3201001, "address" : "백두산"}
    ,{ "id" : 4301001, "address" : "한라산"}
    ,{ "id" : 5401001, "address" : "몰디브"}
] # 같은 key들을 가진 딕셔너리들이 담긴 리스트
pd.DataFrame.from_dict(dict_list) # 이렇게 넣어도, key들이 컬럼이 되어 데이터프레임이 만들어진다.
# 실무적으로는 이 형태를 더 많이 쓰게 된다.

        id address
0  1001001   AABCC
1  2101001   BBBDD
2  3201001     백두산
3  4301001     한라산
4  5401001     몰디브

### 1-2. Column만 존재하는 빈 Dataframe을 만들고, 내용 채워 넣기

In [5]:
df = pd.DataFrame(columns=['A','B','BB','C','D'])
# 컬럼들이 될 리스트를 columns parameter에 argument로 넘김
df

Empty DataFrame
Columns: [A, B, BB, C, D]
Index: []

In [6]:
df['A'] = [1,3,1]
df

   A    B   BB    C    D
0  1  NaN  NaN  NaN  NaN
1  3  NaN  NaN  NaN  NaN
2  1  NaN  NaN  NaN  NaN

In [7]:
df['B'] = [4,4,6]
df

   A  B   BB    C    D
0  1  4  NaN  NaN  NaN
1  3  4  NaN  NaN  NaN
2  1  6  NaN  NaN  NaN

In [8]:
df.loc[((df['A'] == 1) & (df['B'] == 4)), 'C'] = 444
df
# 컬럼 값 조건을 걸고 값을 변경

   A  B   BB    C    D
0  1  4  NaN  444  NaN
1  3  4  NaN  NaN  NaN
2  1  6  NaN  NaN  NaN

In [9]:
df.loc[(df['B'] == 4), 'C'] = 0
df
# 컬럼 값 조건을 걸고 값을 변경 2

   A  B   BB    C    D
0  1  4  NaN    0  NaN
1  3  4  NaN    0  NaN
2  1  6  NaN  NaN  NaN

In [10]:
sample_list = [1,2,3,4,5]
# 해당 데이터프레임 가장 아래에 리스트를 row로 넣음
df.loc[len(df)] = sample_list
# 이 방식은 좀 느린 편이며, 데이터프레임에 행을 추가해야 한다면
# 자료를 dictionary로 관리하다가 모든 데이터 추가가 다 끝나고 데이터프레임으로 변환하는 것이 빠름
df

   A  B   BB    C    D
0  1  4  NaN    0  NaN
1  3  4  NaN    0  NaN
2  1  6  NaN  NaN  NaN
3  1  2    3    4    5

## 2. Indexing, 값 변경 & 추가

### 2-1. loc : 라벨 인덱싱

In [11]:
print(type(df.loc[0]))
df.loc[0]
# loc의 첫 번째 인자는 '행 라벨' 이다.
# 그래서 0을 넣으면, index가 0인 행을 series로 반환하고 있다.

<class 'pandas.core.series.Series'>

A       1
B       4
BB    NaN
C       0
D     NaN
Name: 0, dtype: object

In [12]:
print(type(df.loc[0, 'A']))
df.loc[0, 'A']
# 두 번째 인자는 컬럼명이다.

<class 'numpy.int64'>

1

In [13]:
df.loc[[0,1,2,3], ['A','B']]
# 이런 식으로 접근하면, 다중 컬럼과 행을 데이터프레임으로 가져올 수 있다.

   A  B
0  1  4
1  3  4
2  1  6
3  1  2

In [14]:
df.loc[df.index[0:3], ['A','B']]
# df.index로도 접근 가능

   A  B
0  1  4
1  3  4
2  1  6

In [15]:
df.loc[df['B'] == 4]
# row에 값 조건을 걸 수도 있다.

   A  B   BB  C    D
0  1  4  NaN  0  NaN
1  3  4  NaN  0  NaN

In [16]:
df.loc[df['B'] == 4, df.columns.str.contains('B')]
# 컬럼 이름에도 조건을 걸 수 있다. 위의 경우, 컬럼 이름에 B를 포함하는 컬럼만 가져옴.

   B   BB
0  4  NaN
1  4  NaN

In [17]:
df.loc[:,df.columns.str.contains('B')]
# 행 조건 자리에 :를 넣으면, 행에 대해서는 전체를 다 가져오라는 뜻이다.

   B   BB
0  4  NaN
1  4  NaN
2  6  NaN
3  2    3

In [18]:
print(df.columns) # 컬럼명을 가져옴
print(df.columns.str)
print(df.columns.str.contains('B')) # boolean indexing이 가능한 형태가 된다.
print(type(df.columns.str.contains('B'))) # 결과물은 false와 true가 들어간 ndarray
print(df.columns.str.startswith('A')) # 이렇게 하면 A로 시작하는 컬럼을 가져올 수 있음
# 결론은, 다른 외부 함수를 사용해서 어쩄든 boolean 타입 값이 담긴 리스트를 만들면, loc에 넣어서 boolean indexing이 가능하다는 것.

Index(['A', 'B', 'BB', 'C', 'D'], dtype='object')
<pandas.core.strings.StringMethods object at 0x000001E1FEC0B250>
[False  True  True False False]
<class 'numpy.ndarray'>
[ True False False False False]

In [19]:
df.loc[:,'new'] = 3
df
# loc으로도 기존에 없던 새 컬럼을 추가할 수 있음

   A  B   BB    C    D  new
0  1  4  NaN    0  NaN    3
1  3  4  NaN    0  NaN    3
2  1  6  NaN  NaN  NaN    3
3  1  2    3    4    5    3

In [20]:
df.loc[4] = [1] * len(df.columns)
df.loc[99] = [1] * len(df.columns)
df.loc['cool'] = [22] * len(df.columns)
# dataframe에 행을 추가함. index가 늘어난다.
df

       A   B   BB    C    D  new
0      1   4  NaN    0  NaN    3
1      3   4  NaN    0  NaN    3
2      1   6  NaN  NaN  NaN    3
3      1   2    3    4    5    3
4      1   1    1    1    1    1
99     1   1    1    1    1    1
cool  22  22   22   22   22   22

### 2-2. iloc : 위치 인덱싱

In [21]:
df.iloc[0:2,0:4]
# 기본적 동작은 loc과 동일하나, 받는 인자가 라벨이 아니고 '위치'다.

   A  B   BB  C
0  1  4  NaN  0
1  3  4  NaN  0

In [22]:
df.iloc[4:7,0:4]
# 위치를 받기 때문에, index는 99여도 5번째 줄로 인식됨

       A   B  BB   C
4      1   1   1   1
99     1   1   1   1
cool  22  22  22  22

In [23]:
df.iloc[7] = [2] * len(df.columns)
# IndexError: iloc cannot enlarge its target object
# 위치를 인자로 받기 때문에, 새로운 컬럼, 행을 만든다거나 하는 행위는 불가능하다.

IndexError: iloc cannot enlarge its target object

### 2-3. at : 스칼라값 접근

In [35]:
df.at[1,'A']
# 한 번에 1개의 스칼라값에만 접근 가능
# 여러 개의 값에 접근하려고 범위를 지정하면, 에러를 출력한다.
# 단일 값에 접근하는 목적이라면 loc보다 훨씬 빠름

3

In [36]:
df.at[1,'A'] = 100
df
# 값을 딱 하나만 바꾸고 싶다! 라고 하면 at을 활용해보자.

        A   B   BB    C    D  new
0       1   4  NaN    0  NaN    3
1     100   4  NaN    0  NaN    3
2       1   6  NaN  NaN  NaN    3
3       1   2    3    4    5    3
4       1   1    1    1    1    1
99      1   1    1    1    1    1
cool   22  22   22   22   22   22

In [37]:
df.at[99, 'new']
# 그 이외에는 label base인 것이 loc과 똑같음

1

### 2-4. iat : iloc의 스칼라 버전

In [38]:
df.iat[4,2]
# iloc의 스칼라 버전.
# 이외의 동작은 at과 같다.

1

In [39]:
df.iat[df.index.get_loc('cool'),df.columns.get_loc('new')]
# get_loc을 쓰면, 해당 인덱스와 컬럼의 위치를 반환받을 수 있음.
# 그럼 인덱스와 컬럼의 이름으로도 iat, iloc을 이용 가능

22

### 2-5 map : Series의 원소 하나하나에 함수 적용
 - map함수는 DataFrame 타입이 아니라, 반드시 Series 타입에서만 사용해야 한다.
 - Series를 한마디로 정의하면 딱 이거다.
     - 값(value) + 인덱스(index) = 시리즈 클래스(Series)
 - Series는 NumPy에서 제공하는 1차원 배열과 비슷하지만 각 데이터의 의미를 표시하는 인덱스(index)를 붙일 수 있다. 하지만 데이터 자체는 그냥 값(value)의 1차원 배열이다.
 - map함수는 Series의 이러한 값 하나하나에 접근하면서 해당 함수를 수행한다.

In [40]:
import math as m # sqrt 함수 사용을 위해 부름
# http://www.leejungmin.org/post/2018/04/21/pandas_apply_and_map/
df["map_b"] = df["B"].map(lambda x : m.sqrt(x)) 
# B컬럼의 값 하나하나에 sqrt 함수를 적용한 결과를 map_b 컬럼으로 추가
df

        A   B   BB    C    D  new     map_b
0       1   4  NaN    0  NaN    3  2.000000
1     100   4  NaN    0  NaN    3  2.000000
2       1   6  NaN  NaN  NaN    3  2.449490
3       1   2    3    4    5    3  1.414214
4       1   1    1    1    1    1  1.000000
99      1   1    1    1    1    1  1.000000
cool   22  22   22   22   22   22  4.690416

### 2-6. apply : 커스텀 함수에 복수 개의 컬럼이 필요하다면
- 커스텀 함수를 사용하기 위해 DataFrame에서 복수 개의 컬럼이 필요하다면, apply 함수를 사용해야 한다.

In [41]:
import math as m # sqrt 함수 사용을 위해 부름
# 두 컬럼의 제곱근의 값을 각각 곱하는 함수
def sqrt_multi(x,y):
    return m.sqrt(x) * m.sqrt(y)

In [42]:
df.loc[:,'new'] = df.apply(lambda x : sqrt_multi(x['A'], x['B']), axis=1) # axis=1 이면 각 열의 원소에 대해 연산 수행
df

        A   B   BB    C    D        new     map_b
0       1   4  NaN    0  NaN   2.000000  2.000000
1     100   4  NaN    0  NaN  20.000000  2.000000
2       1   6  NaN  NaN  NaN   2.449490  2.449490
3       1   2    3    4    5   1.414214  1.414214
4       1   1    1    1    1   1.000000  1.000000
99      1   1    1    1    1   1.000000  1.000000
cool   22  22   22   22   22  22.000000  4.690416

In [43]:
df["apply_bb_d"] = df.apply(lambda x : sqrt_multi(x['BB'], x['B']), axis=1) # axis=1 이면 각 열의 원소에 대해 연산 수행
df # NaN과의 연산은 NaN이 됨을 참고하자.

        A   B   BB    C    D        new     map_b  apply_bb_d
0       1   4  NaN    0  NaN   2.000000  2.000000         NaN
1     100   4  NaN    0  NaN  20.000000  2.000000         NaN
2       1   6  NaN  NaN  NaN   2.449490  2.449490         NaN
3       1   2    3    4    5   1.414214  1.414214     2.44949
4       1   1    1    1    1   1.000000  1.000000     1.00000
99      1   1    1    1    1   1.000000  1.000000     1.00000
cool   22  22   22   22   22  22.000000  4.690416    22.00000

### 2-7. index, columns로 index와 컬럼명 직접 지정

In [44]:
print(df.columns)
print(type(df.columns))
print(df.index)
print(type(df.index))
print(df.columns[2]) # 위치값으로 개별 요소에 접근 가능
print(df.index[6])

Index(['A', 'B', 'BB', 'C', 'D', 'new', 'map_b', 'apply_bb_d'], dtype='object')
<class 'pandas.core.indexes.base.Index'>
Index([0, 1, 2, 3, 4, 99, 'cool'], dtype='object')
<class 'pandas.core.indexes.base.Index'>
BB
cool

In [45]:
df.columns = ['가', '나', '다', '라', '마', '바', '사', '아'] 
# df.columns에 직접 컬럼명 리스트를 할당하여 컬럼명 변경 가능
# 기존 컬럼 수와 같은 길이의 리스트를 넣지 않으면 오류가 발생함
print(df.columns)
print(type(df.columns))

Index(['가', '나', '다', '라', '마', '바', '사', '아'], dtype='object')
<class 'pandas.core.indexes.base.Index'>

In [46]:
df.index = [1,2,3,4,5,6,7] 
# df.columns에 직접 컬럼명 리스트를 할당하여 컬럼명 변경 가능
print(df.index)
print(type(df.index))

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64')
<class 'pandas.core.indexes.numeric.Int64Index'>

### 2-8. set_index로 index 설정
```DataFrame.set_index(keys, drop=True, append=False, inplace=False)```
- keys에는 index로 할당하고자 하는 열의 레이블을 입력한다.
  - multi-index를 하고 싶으면, ['가', '나'] 이렇게 열 레이블 배열을 입력한다.
- drop : index로 할당한 열을 삭제할까요?
- append : 기존에 존재하던 index를 삭제할까요?
- inplace : 원본 데이터프레임을 변경할까요?

In [47]:
df

     가   나    다    라    마          바         사         아
1    1   4  NaN    0  NaN   2.000000  2.000000       NaN
2  100   4  NaN    0  NaN  20.000000  2.000000       NaN
3    1   6  NaN  NaN  NaN   2.449490  2.449490       NaN
4    1   2    3    4    5   1.414214  1.414214   2.44949
5    1   1    1    1    1   1.000000  1.000000   1.00000
6    1   1    1    1    1   1.000000  1.000000   1.00000
7   22  22   22   22   22  22.000000  4.690416  22.00000

In [48]:
df.set_index('가') # 기본값

      나    다    라    마          바         사         아
가
1     4  NaN    0  NaN   2.000000  2.000000       NaN
100   4  NaN    0  NaN  20.000000  2.000000       NaN
1     6  NaN  NaN  NaN   2.449490  2.449490       NaN
1     2    3    4    5   1.414214  1.414214   2.44949
1     1    1    1    1   1.000000  1.000000   1.00000
1     1    1    1    1   1.000000  1.000000   1.00000
22   22   22   22   22  22.000000  4.690416  22.00000

In [49]:
df.set_index('가', drop=False) # index로 선택된 열 삭제 안 함

       가   나    다    라    마          바         사         아
가
1      1   4  NaN    0  NaN   2.000000  2.000000       NaN
100  100   4  NaN    0  NaN  20.000000  2.000000       NaN
1      1   6  NaN  NaN  NaN   2.449490  2.449490       NaN
1      1   2    3    4    5   1.414214  1.414214   2.44949
1      1   1    1    1    1   1.000000  1.000000   1.00000
1      1   1    1    1    1   1.000000  1.000000   1.00000
22    22  22   22   22   22  22.000000  4.690416  22.00000

In [50]:
df.set_index('가', append=True) # 기존 index 삭제 안 함

        나    다    라    마          바         사         아
  가
1 1     4  NaN    0  NaN   2.000000  2.000000       NaN
2 100   4  NaN    0  NaN  20.000000  2.000000       NaN
3 1     6  NaN  NaN  NaN   2.449490  2.449490       NaN
4 1     2    3    4    5   1.414214  1.414214   2.44949
5 1     1    1    1    1   1.000000  1.000000   1.00000
6 1     1    1    1    1   1.000000  1.000000   1.00000
7 22   22   22   22   22  22.000000  4.690416  22.00000

In [51]:
df.set_index(['가','나']) # 동시에 여러 열을 index로 설정하기

          다    라    마          바         사         아
가   나
1   4   NaN    0  NaN   2.000000  2.000000       NaN
100 4   NaN    0  NaN  20.000000  2.000000       NaN
1   6   NaN  NaN  NaN   2.449490  2.449490       NaN
    2     3    4    5   1.414214  1.414214   2.44949
    1     1    1    1   1.000000  1.000000   1.00000
    1     1    1    1   1.000000  1.000000   1.00000
22  22   22   22   22  22.000000  4.690416  22.00000

### 2-9. reset_index로 index 초기화
```DataFrame.reset_index(drop=False, inplace=False)```
- 기존에 있던 index 대신에, 0부터 시작하여 1씩 늘어나는 정수 index를 추가한다.
- drop : 기존에 index였던 열을 삭제할까요?
- inplace : 원본 데이터프레임을 변경할까요?

In [52]:
df.reset_index()

   index    가   나    다    라    마          바         사         아
0      1    1   4  NaN    0  NaN   2.000000  2.000000       NaN
1      2  100   4  NaN    0  NaN  20.000000  2.000000       NaN
2      3    1   6  NaN  NaN  NaN   2.449490  2.449490       NaN
3      4    1   2    3    4    5   1.414214  1.414214   2.44949
4      5    1   1    1    1    1   1.000000  1.000000   1.00000
5      6    1   1    1    1    1   1.000000  1.000000   1.00000
6      7   22  22   22   22   22  22.000000  4.690416  22.00000

In [53]:
df.reset_index(drop=True)

     가   나    다    라    마          바         사         아
0    1   4  NaN    0  NaN   2.000000  2.000000       NaN
1  100   4  NaN    0  NaN  20.000000  2.000000       NaN
2    1   6  NaN  NaN  NaN   2.449490  2.449490       NaN
3    1   2    3    4    5   1.414214  1.414214   2.44949
4    1   1    1    1    1   1.000000  1.000000   1.00000
5    1   1    1    1    1   1.000000  1.000000   1.00000
6   22  22   22   22   22  22.000000  4.690416  22.00000

## 3. 값 삭제, 대체
 - 특정 조건의 값을 삭제하고 싶은 경우에는, 해당 조건의 반대 조건을 걸어서 반환 결과를 사용하는 식으로 처리한다.

### 3-1. drop : 원하는 행, 열 지우기
```DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')```
 - 특정 레이블의 행이나 열을 제거한다.
 - labels : 제거할 index, 레이블 하나 혹은 리스트 (list-like)
 - axis : 0이면 행, 1이면 컬럼 대상
 - index : labels, axis=0 대신 사용가능
 - columns : labels, axis=1 대신 사용가능
 - level : MultiIndex일 경우, 어떤 레벨을 제거할 것인지
 - inplace : 원본 변경 할 건가요?
 - errors : 'ignore'로 세팅하면, 에러 출력 안 하고 존재하는 레이블만 제거한다.

In [54]:
df

     가   나    다    라    마          바         사         아
1    1   4  NaN    0  NaN   2.000000  2.000000       NaN
2  100   4  NaN    0  NaN  20.000000  2.000000       NaN
3    1   6  NaN  NaN  NaN   2.449490  2.449490       NaN
4    1   2    3    4    5   1.414214  1.414214   2.44949
5    1   1    1    1    1   1.000000  1.000000   1.00000
6    1   1    1    1    1   1.000000  1.000000   1.00000
7   22  22   22   22   22  22.000000  4.690416  22.00000

In [55]:
df.drop(labels=['가','아'], axis=1)

    나    다    라    마          바         사
1   4  NaN    0  NaN   2.000000  2.000000
2   4  NaN    0  NaN  20.000000  2.000000
3   6  NaN  NaN  NaN   2.449490  2.449490
4   2    3    4    5   1.414214  1.414214
5   1    1    1    1   1.000000  1.000000
6   1    1    1    1   1.000000  1.000000
7  22   22   22   22  22.000000  4.690416

In [56]:
df.drop(labels=[1,7], axis=0)

     가  나    다    라    마          바         사        아
2  100  4  NaN    0  NaN  20.000000  2.000000      NaN
3    1  6  NaN  NaN  NaN   2.449490  2.449490      NaN
4    1  2    3    4    5   1.414214  1.414214  2.44949
5    1  1    1    1    1   1.000000  1.000000  1.00000
6    1  1    1    1    1   1.000000  1.000000  1.00000

In [57]:
df.drop(columns=['가','아'])
# df.drop(labels=['가','아'], axis=1)와 같은 결과

    나    다    라    마          바         사
1   4  NaN    0  NaN   2.000000  2.000000
2   4  NaN    0  NaN  20.000000  2.000000
3   6  NaN  NaN  NaN   2.449490  2.449490
4   2    3    4    5   1.414214  1.414214
5   1    1    1    1   1.000000  1.000000
6   1    1    1    1   1.000000  1.000000
7  22   22   22   22  22.000000  4.690416

### 3-2. Na 대응

#### 3-2-1. isna : NaN인지 각 값에 대해 확인
- NaN인지 각 값에 대해 확인하여 boolean으로 표현
- isnull() 도 완전히 같은 기능을 한다.
- 왜 같은 기능을 하는 함수가 두 개나 있는지는 아래 링크를 참조
  - https://datascience.stackexchange.com/questions/37878/difference-between-isna-and-isnull-in-pandas
  > This is because pandas' DataFrames are based on R's DataFrames. In R na and null are two separate things. Read [this post](https://www.r-bloggers.com/2010/04/r-na-vs-null/) for more information. 
    However, in python, pandas is built on top of numpy, **which has neither na nor null values. Instead numpy has NaN values (which stands for "Not a Number").** Consequently, pandas also uses NaN values.

In [58]:
df.isna()
# 특정 컬럼, 행에 대해서도 사용 가능

       가      나      다      라      마      바      사      아
1  False  False   True  False   True  False  False   True
2  False  False   True  False   True  False  False   True
3  False  False   True   True   True  False  False   True
4  False  False  False  False  False  False  False  False
5  False  False  False  False  False  False  False  False
6  False  False  False  False  False  False  False  False
7  False  False  False  False  False  False  False  False

#### 3-2-2. dropna : NA 드랍
```DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)```
- axis
  - 0 혹은 'index' : missing value가 있는 행을 드랍
  - 1 혹은 'columns' : missing value가 있는 열을 드랍
- how
  - any : missing value가 하나라도 있으면 드랍
  - all : 전체 값이 다 missing value여야 드랍
- thresh : 문턱값. 정수를 입력 시, 정상값이 해당 정수 갯수만큼은 있어야 제거 안 함
- subset : list-like 오브젝트를 넣으면, 해당 index나 컬럼에서만 missing value 체크
- inplace : 원본 변경 할 건가요?

In [59]:
df

     가   나    다    라    마          바         사         아
1    1   4  NaN    0  NaN   2.000000  2.000000       NaN
2  100   4  NaN    0  NaN  20.000000  2.000000       NaN
3    1   6  NaN  NaN  NaN   2.449490  2.449490       NaN
4    1   2    3    4    5   1.414214  1.414214   2.44949
5    1   1    1    1    1   1.000000  1.000000   1.00000
6    1   1    1    1    1   1.000000  1.000000   1.00000
7   22  22   22   22   22  22.000000  4.690416  22.00000

In [60]:
df.dropna() # 기본적으로 행 드랍

    가   나   다   라   마          바         사         아
4   1   2   3   4   5   1.414214  1.414214   2.44949
5   1   1   1   1   1   1.000000  1.000000   1.00000
6   1   1   1   1   1   1.000000  1.000000   1.00000
7  22  22  22  22  22  22.000000  4.690416  22.00000

In [61]:
df.dropna(axis=1) # 열 드랍

     가   나          바         사
1    1   4   2.000000  2.000000
2  100   4  20.000000  2.000000
3    1   6   2.449490  2.449490
4    1   2   1.414214  1.414214
5    1   1   1.000000  1.000000
6    1   1   1.000000  1.000000
7   22  22  22.000000  4.690416

In [62]:
df.dropna(thresh=5) # index 3인 행은 정상값이 4개였음

     가   나    다   라    마          바         사         아
1    1   4  NaN   0  NaN   2.000000  2.000000       NaN
2  100   4  NaN   0  NaN  20.000000  2.000000       NaN
4    1   2    3   4    5   1.414214  1.414214   2.44949
5    1   1    1   1    1   1.000000  1.000000   1.00000
6    1   1    1   1    1   1.000000  1.000000   1.00000
7   22  22   22  22   22  22.000000  4.690416  22.00000

In [65]:
df.dropna(axis=0, subset=['라']) # '라'열만 검사해서 NaN이 있는 행을 제거함

     가   나    다   라    마          바         사         아
1    1   4  NaN   0  NaN   2.000000  2.000000       NaN
2  100   4  NaN   0  NaN  20.000000  2.000000       NaN
4    1   2    3   4    5   1.414214  1.414214   2.44949
5    1   1    1   1    1   1.000000  1.000000   1.00000
6    1   1    1   1    1   1.000000  1.000000   1.00000
7   22  22   22  22   22  22.000000  4.690416  22.00000

#### 3-2-3. fillna : NaN 데이터 대체하기
`DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None)`
- value : NaN을 무엇으로 채울 것인가?
  - scalar : 0, 1 따위의 값을 넣음
  - dict : {"A": 0, "B": 1, "C": 2, "D": 3}
    - 컬럼 A의 NaN은 0으로, 컬럼 B의 NaN은 1로, 컬럼 C의 NaN은 2로, 컬럼 D의 NaN은 3으로 대체
  - dataframe : 대체 대상 dataframe와 같은 크기의 dataframe을 준비한 후, value에 dataframe을 넣으면 NaN 값만 넣은 dataframe의 값으로 대체된다. 컬럼명이나 인덱스는 원본 dataframe의 것이 유지된다.
- method : 어떤 방법으로 채울까? (value와 같이 사용할 수 없음)
  - backfill, bfill : NaN의 다음 값으로 NaN 채우기.
  - ffill, pad : NaN의 직전 값으로 NaN 채우기.
- axis
  - 0 혹은 'index'
  - 1 혹은 'columns'
- inplace : 원본 변경 할 건가요?
- limit : 위에서부터 NaN 몇 개만 바꿀래? 기본값 None이면 모든 NaN을 바꾸는 것.

In [69]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, 5],
                   [np.nan, 3, np.nan, 4]],
                  columns=list("ABCD"))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [71]:
df.fillna(value=0) # 0으로 NaN 채우기

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5
3  0.0  3.0  0.0  4

In [75]:
df.fillna(method='ffill') # NaN의 직전 값으로 NaN 채우기. 'pad'를 써도 마찬가지

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  3.0  4.0 NaN  5
3  3.0  3.0 NaN  4

In [76]:
df.fillna(method='bfill') # NaN의 다음 값으로 NaN 채우기. 'backfill'을 써도 마찬가지

     A    B   C  D
0  3.0  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  3.0 NaN  5
3  NaN  3.0 NaN  4

In [81]:
values = {"A": 0, "B": 1, "C": 2, "D": 3}
df.fillna(value=values) # values에 dictionary를 넣어서 컬럼마다 NaN을 다른 값으로 대체

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5
3  0.0  3.0  2.0  4

In [83]:
df.fillna(value=values, limit=1) # limit=1이어서, 최초의 NaN 하나만 대체

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  NaN  1
2  NaN  1.0  NaN  5
3  NaN  3.0  NaN  4

In [85]:
df2 = pd.DataFrame(np.zeros((4, 4)), columns=list("ABCE"))
df2 # 4 by 4 영행렬을 만들어 보자

     A    B    C    E
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0

In [87]:
df.fillna(df2) #원본 df의 컬럼이 유지됨

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5
3  0.0  3.0  0.0  4

In [101]:
df.loc[:,'A'].fillna(df.loc[:,'A'].mean()) # A열의 NaN 값을 A열의 평균으로 채움

0    3.0
1    3.0
2    3.0
3    3.0
Name: A, dtype: float64

### 3-3. drop_duplicates : 중복값 제거

`DataFrame.drop_duplicates(subset=None, keep='first', inplace=False, ignore_index=False)`

- subset : 컬럼 라벨, 혹은 컬럼 라벨 리스트
  - 넣은 특정 컬럼만 중복값을 체크함. 기본으로는 전체 컬럼의 값이 다 같아야 제거
- keep
  - first : 첫 번째 등장한 것을 제외하면 다 제거
  - last : 마지막에 등장한 것을 제외하면 다 제거
  - False : 몽땅 다 제거
- inplace : 원본 변경 할 건가요?
- ignore_index : True 값을 넣으면, 결과값의 인덱스를 0, 1, ... n-1로 라벨링함

In [102]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [104]:
df.drop_duplicates() # 모든 열의 값이 다 같으면 제거

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [106]:
df.drop_duplicates(subset=['brand']) # brand 컬럼 하나에서만 값이 같아도 제거

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5

In [108]:
df.drop_duplicates(subset=['brand', 'style'], keep='last')
# brand, style 모두 같으면, 마지막 값만 남김

     brand style  rating
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
4  Indomie  pack     5.0

## 4. Dataframe 결합

### 4-1. 위아래로 붙이는 단순 결합의 경우, 어떤 방식이 가장 빠른가?
- 결론부터 말하자면 데이터를 Dictionary의 리스트로 관리하다가 마지막에 Dataframe으로 만드는 것이 가장 빠르다.
  - https://stackoverflow.com/questions/57000903/what-is-the-fastest-and-most-efficient-way-to-append-rows-to-a-dataframe
  ```Python
    start_time = time.time()
    dictinary_list = []
    for i in range(0, end_value, 1):
        dictionary_data = {k: random.random() for k in range(30)}
        dictionary_list.append(dictionary_data)

    df_final = pd.DataFrame.from_dict(dictionary_list)

    end_time = time.time()
    print('Execution time = %.6f seconds' % (end_time-start_time))
  ```
  <br>
  - 그럼 리스트 합치는 건 뭐가 제일 빠르지?
    - https://www.realpythonproject.com/day15-the-fastest-way-to-combine-lists-in-python/
    > append() is the fastest but it doesn’t combine the elements of both the lists. **The + operator seems to be the ideal option.** However, this has been done on a comparatively smaller dataset and results may vary when you try it on your own.
- 인생은 항상 원하는대로 흘러가지 않기에, 다른 방법도 알아보자.

#### 4-1-1. concat
`pandas.concat(objs, axis=0, join='outer', ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=False, copy=True)`

In [119]:
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1, s2]) # Series 두 개 합치기

0    a
1    b
0    c
1    d
dtype: object

In [120]:
pd.concat([s1, s2], ignore_index=True) # 합치면서 index 새로 만들어줌

0    a
1    b
2    c
3    d
dtype: object

In [141]:
s3 = pd.concat([s1, s2], keys=['s1', 's2']) # 최외각 레벨에 새로운 index를 만들어줌
print(s3)
print(s3['s1']) 
print(s3['s2'][0]) # 이렇게 조회가능

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object
0    a
1    b
dtype: object
c

In [140]:
s3 = pd.concat([s1, s2], keys=['s1', 's2'], names=['Series name', 'Row ID']) # index에 이름 붙이기
print(s3)
print(s3.index)
print(s3.index.names)

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object
MultiIndex([('s1', 0),
            ('s1', 1),
            ('s2', 0),
            ('s2', 1)],
           names=['Series name', 'Row ID'])
['Series name', 'Row ID']

In [142]:
df1 = pd.DataFrame([['a', 1], ['b', 2]], columns=['letter', 'number'])
print(df1)
df2 = pd.DataFrame([['c', 3], ['d', 4]], columns=['letter', 'number'])
print(df2)
pd.concat([df1, df2]) # Dataframe 합치기

  letter  number
0      a       1
1      b       2
  letter  number
0      c       3
1      d       4

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [143]:
df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                   columns=['letter', 'number', 'animal'])
print(df3)
pd.concat([df1, df3], sort=False) # 한 쪽에 없는 컬럼의 값은 NaN으로 삽입됨

  letter  number animal
0      c       3    cat
1      d       4    dog

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [144]:
pd.concat([df1, df3], join="inner") # join="inner"로 하면 양쪽에 다 있는 컬럼만 합쳐서 반환함

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [145]:
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
                   columns=['animal', 'name'])
pd.concat([df1, df4], axis=1) # axis=1이면 컬럼을 붙임

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

In [147]:
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george'], ['dog', 'sam']],
                   columns=['animal', 'name'])
pd.concat([df1, df4], axis=1) 
# axis=1이면 컬럼을 붙임
# 행의 수가 다르면, 행이 적은 쪽에 NaN이 삽입된 행이 추가됨

  letter  number  animal    name
0      a     1.0    bird   polly
1      b     2.0  monkey  george
2    NaN     NaN     dog     sam

In [149]:
#collapse-output
df5 = pd.DataFrame([1], index=['a'])
df6 = pd.DataFrame([2], index=['a'])
pd.concat([df5, df6], verify_integrity=True)
# verify_integrity=True를 하면, index가 같은 것을 허용하지 않음.

ValueError: Indexes have overlapping values: Index(['a'], dtype='object')

### 4-2. Merge : Database의 Join처럼 Dataframe 합치기
`DataFrame.merge(right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)`

- right : 합칠 Dataframe
- how : {‘left’, ‘right’, ‘outer’, ‘inner’, ‘cross’}, default ‘inner’
  - left: use only keys from left frame, similar to a SQL left outer join; preserve key order.
  - right: use only keys from right frame, similar to a SQL right outer join; preserve key order.
  - outer: use union of keys from both frames, similar to a SQL full outer join; sort keys lexicographically.
  - inner: use intersection of keys from both frames, similar to a SQL inner join; preserve the order of the left keys.
  - cross: creates the cartesian product from both frames, preserves the order of the left keys.
- on : label or list
  - 조인할 컬럼이나 인덱스 레벨의 이름. 두 Dataframe에 무조건 있어야 한다.
- left_on : label or list, or array-like
  - 왼쪽 Dataframe의 조인할 컬럼이나 인덱스 레벨의 이름.
- right_on : label or list, or array-like
  - 오른쪽 Dataframe의 조인할 컬럼이나 인덱스 레벨의 이름.
- left_index : bool, default False
  - 왼쪽 index를 조인의 key로 사용할까요?
  - MultiIndex인 경우, 상대 Dataframe의 key 수가 level의 수와 동일해야 함.
- right_index : bool, default False
  - 오른쪽 index를 조인의 key로 사용할까요?
  - MultiIndex인 경우, 상대 Dataframe의 key 수가 level의 수와 동일해야 함.
- sort : bool, default False
  - 조인 결과 Dataframe에서 key를 사전 순서(lexicographically)로 배열함
  - False인 경우, 조인 방법에 정의된 방법을 따라감
- suffixes : list-like, default is (“_x”, “_y”)
  - 컬럼에 접미사를 붙인다. 왼쪽 오른쪽 구분용.
  - 기본적으로 왼쪽에 _x, 오른쪽에 _y가 붙는다.
- copy : bool, default True
  - False면, 가능하면 복사를 피한다.
- indicator : bool or str, default False
- validate : str, optional
  - If specified, checks if merge is of specified type.
      - “one_to_one” or “1:1”: check if merge keys are unique in both left and right datasets.
      - “one_to_many” or “1:m”: check if merge keys are unique in left dataset.
      - “many_to_one” or “m:1”: check if merge keys are unique in right dataset.
      - “many_to_many” or “m:m”: allowed, but does not result in checks.

In [159]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'], 'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'], 'value': [5, 6, 7, 8]})
display(df1)
display(df2)

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [164]:
display(df1.merge(df2, left_on='lkey', right_on='rkey'))
# 뒤에 _x, _y가 붙은 것을 확인.
df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=('_left', '_right'))
# _left, _right로 바꿔 보았음

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

In [168]:
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
display(df1)
display(df2)

     a  b
0  foo  1
1  bar  2

     a  c
0  foo  3
1  baz  4

In [170]:
df1.merge(df2, how='inner', on='a')
# a 컬럼을 키로 잡음. 두 Dataframe에 다 a 컬럼이 있어서 가능한것
# inner join

     a  b  c
0  foo  1  3

In [172]:
df1.merge(df2, how='left', on='a')
# left outer join

     a  b    c
0  foo  1  3.0
1  bar  2  NaN

In [173]:
df1.merge(df2, how='left', left_on='a', right_on='a')
# left outer join

     a  b    c
0  foo  1  3.0
1  bar  2  NaN

#### 4-2-1. Dataframe Join의 속도를 향상시키기 위해서는?
- https://stackoverflow.com/questions/40860457/improve-pandas-merge-performance
- key를 index로 사용한다.
  - index 검색 시에는 hash table을 이용하기 때문
  > A short explanation why it is faster to merge by index instead of by a "normal" column: Indices have a hash table. Meaning you can look them up in amortized O(1). For a normal column you need O(n) in worst case, meaning merging two dfs with len n takes O(n^2) in worst case.
- join을 쓴다.
- concat을 쓴다.

**여기서의 결론** : key를 index로 사용한 후 join을 쓴다.

In [183]:
df1 = pd.DataFrame({'uid_sample': random.sample(range(100000), 80000), 'value': random.sample(range(10000000), 80000)})
df2 = pd.DataFrame({'userId_sample2': random.sample(range(100000), 80000), 'value': random.sample(range(10000000), 80000)})
# 80000명의 정보를 담고 있는 두 Dataframe이 있다고 하자.
# uid_sample, userId_sample2를 key로 조인하고 싶다.

In [190]:
%%timeit
df1.merge(df2, how='left', left_on='uid_sample', right_on='userId_sample2')

18.7 ms ± 2.26 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [207]:
%%timeit
# key로 사용하려는 컬럼을 index로 할당
# 36%정도 빨라졌다!
df3 = df1.set_index('uid_sample')
df4 = df2.set_index('userId_sample2')
df3.merge(df4, right_index=True, left_index=True)

12.4 ms ± 668 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [197]:
%%timeit
# key로 사용하려는 컬럼을 index로 할당
# join 함수 사용
# 여기서 이미 2.5배 빨라졌다
df3 = df1.set_index('uid_sample')
df4 = df2.set_index('userId_sample2')
df3.join(df4, how='left', lsuffix='left', rsuffix='right')

7.52 ms ± 462 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [205]:
%%timeit
# inner, outer밖에 안 되는데 join보다 느리다.
df3 = df1.set_index('uid_sample')
df4 = df2.set_index('userId_sample2')
pd.concat([df3, df4], axis=1, join='inner')

11.7 ms ± 623 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

## 5. 데이터 재구조화

### 5.1 Pivot : 엑셀에서 보던 그것

`DataFrame.pivot(index=None, columns=None, values=None)`
- index : str or object or a list of str, optional
  - 새로운 프레임의 index로 사용할 컬럼
- columns : str of object or a list of str
  - 새로운 프레임의 컬럼으로 사용할 컬럼
- values : str, object or a list of the previous, optional
  - 새로운 프레임의 값을 계산하기 위해 사용하는 컬럼
  - 지정하지 않으면, 남아있는 모든 컬럼을 사용한다.

In [216]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                           'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [221]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [222]:
df.pivot(index='foo', columns='bar')

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

In [223]:
df.pivot(index='foo', columns='bar')['baz']

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [224]:
df = pd.DataFrame({
       "lev1": [1, 1, 1, 2, 2, 2],
       "lev2": [1, 1, 2, 1, 1, 2],
       "lev3": [1, 2, 1, 2, 1, 2],
       "lev4": [1, 2, 3, 4, 5, 6],
       "values": [0, 1, 2, 3, 4, 5]})
df

   lev1  lev2  lev3  lev4  values
0     1     1     1     1       0
1     1     1     2     2       1
2     1     2     1     3       2
3     2     1     2     4       3
4     2     1     1     5       4
5     2     2     2     6       5

In [226]:
df.pivot(index="lev1", columns=["lev2", "lev3"] ,values="values")
# Multilevel Column
# 해당하는 조건에 맞는 값이 없으면 NaN이 들어가게 됨

lev2    1         2
lev3    1    2    1    2
lev1
1     0.0  1.0  2.0  NaN
2     4.0  3.0  NaN  5.0

In [227]:
df.pivot(index=["lev1", "lev2"], columns=["lev3"],values="values")
# Multiindex

lev3         1    2
lev1 lev2
1    1     0.0  1.0
     2     2.0  NaN
2    1     4.0  3.0
     2     NaN  5.0

In [228]:
#collapse-output
df.pivot(index=["lev1"], columns=["lev2"],values="values")
# 인덱스, 컬럼 쌍에 중복이 발생하면 에러가 출력됨
# ValueError: Index contains duplicate entries, cannot reshape

ValueError: Index contains duplicate entries, cannot reshape